const theme = {
    font: {
        xs: '11px',
        s: '13px',
        m: '15px',
        l: '18px',
        xl: '20px',
        xxl: '24px',
        xxxl: '32px',
        xxxxl: '48px',
        xxxxxl: '72px',
        xxxxxxl: '96px'  
    },
    lineHeight: {
        xs: '15px',
        s: '18px',
        m: '21px',
        l: '25px',
        xl: '28px',
        xxl: '34px',
        xxxl: '42px',
        xxxxl: '62px',
        xxxxxl: '82px',
        xxxxxxl: '115px',
    },
    color: {
        base: '#fff', /* hsl(0, 0%, 0%) Базовый цвет содержимого, от которого выстраиваются цвета текста, иконок, ...*/
        essential: '#0070f0', /* hsl(0, 0%, 100%) Базовый цвет поверхностей */
        project: '#fff', /* hsl(211, 100%, 35%) Проектный цвет, от которого выстраивают акцентные состояния */
        phantom: '#0056b3', /* hsl(40, 14%, 96%) Тонирующий цвет, от которого выстраиватся бордеры, паранджа, ... */
        path: '#0056b3', /* hsl(220, 100%, 47%) Ссылочный цвет, от которого выстраиваются все их состояния */
        success: '#00985f', /* Цвет успеха */
        alert: '#f33', /* Цвет ошибки */
        warning: '#f90', /* Цвет предупреждения */
        normal: '#dde3e5', /* Цвет нейтральный */
        system: '#778a9b', /* Цвет системнный */
    }
};

export default theme;